---
kind: other
id: Methods.T:Autodesk.Revit.DB.NavisworksExportOptions
source: html/9c1398b3-f7cd-a5d6-b4df-51474ad3f9ec.htm
---
# NavisworksExportOptions Methods

Returns the element ids of the elements to export. Empty by default.